tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
#define USART_BAUD 115200
#define USART_BUFFER_SIZE   256

static void put_char(uint8_t byte)
{
    USART1->DR = (int)(byte);
    while (!(USART1->SR & USART_SR_TXE));
}

typedef struct {
    uint8_t buffer[USART_BUFFER_SIZE];
    uint8_t head_pos;
    uint8_t tail_pos;
} rx_buffer_t;

volatile rx_buffer_t uart_buffer = { { 0 }, 0, 0 };

static void buffer_char(uint8_t c)
{
    __disable_irq();

    int i = (uart_buffer.head_pos + 1) % USART_BUFFER_SIZE;
    
    if (i != uart_buffer.tail_pos) {
        uart_buffer.buffer[uart_buffer.head_pos] = c;
        uart_buffer.head_pos = i;
    }

    __enable_irq();
}

static uint8_t get_char(uint8_t *c)
{
    __disable_irq();

    if(uart_buffer.head_pos == uart_buffer.tail_pos) {
        __enable_irq();
        return 0;
    }
    
    *c = uart_buffer.buffer[uart_buffer.tail_pos];
    uart_buffer.tail_pos = (uart_buffer.tail_pos + 1) % USART_BUFFER_SIZE;
    
    __enable_irq();
    return 1;
}

volatile uint32_t *DWT_CYCCNT = (uint32_t *)0xE0001004;

static void parse(void);

static struct {
  int32_t run_state;
  int32_t dir;
  int32_t step_delay;
  int32_t decel_start;
  int32_t decel_val;
  int32_t min_delay;
  int32_t accel_count;
} jog_state;

enum {
	STOP = 0,
	ACCEL = 1,
	DECEL = 2,
	RUN = 3,
};

static uint32_t sqrt(uint32_t x)
{
	uint32_t xr;
	uint32_t q2;
	uint8_t f;
	xr = 0; 
	q2 = 0x40000000L;
	do {
		if((xr + q2) <= x) {
			x -= xr + q2;
			f = 1;
		} else {
			f = 0;
		}
		xr >>= 1;
		if(f) {
			xr += q2;
		}
	} while(q2 >>= 2);
	if(xr < x) {
		return xr +1;
	} else {
		return xr;
	}
}

static void jog_calc_step_delay_time() {
	int32_t new_step_delay;
	static int32_t last_accel_delay = 0;
	static int32_t step_count = 0;
	static int32_t rest = 0;

	switch(jog_state.run_state) {
		case STOP: {
				step_count = 0;
				rest = 0;
			} break;

		case ACCEL: {
				step_count ++;
				jog_state.accel_count++;
				new_step_delay = jog_state.step_delay - (((2 * (int32_t)jog_state.step_delay) + rest) / (4 * jog_state.accel_count + 1));
				rest = ((2 * (int32_t)jog_state.step_delay)+rest) % (4 * jog_state.accel_count + 1);
				if(step_count >= jog_state.decel_start) {
					jog_state.accel_count = jog_state.decel_val;
					jog_state.run_state = DECEL;
				}
				else if(new_step_delay <= jog_state.min_delay) {
					last_accel_delay = new_step_delay;
					new_step_delay = jog_state.min_delay;
					rest = 0;
					jog_state.run_state = RUN;
				}
			} break;

		case RUN: {
				step_count ++;
				new_step_delay = jog_state.min_delay;
				if(step_count >= jog_state.decel_start) {
					jog_state.accel_count = jog_state.decel_val;
					new_step_delay = last_accel_delay;
					jog_state.run_state = DECEL;
				}
			} break;

		case DECEL: {
				step_count ++;
				jog_state.accel_count++;
				new_step_delay = jog_state.step_delay - (((2 * (int32_t)jog_state.step_delay) + rest) / (4 * jog_state.accel_count + 1));
				rest = ((2 * (int32_t)jog_state.step_delay)+rest) % (4 * jog_state.accel_count + 1);
				if(jog_state.accel_count >= 0){
					jog_state.run_state = STOP;
				}
			} break;
	}

	TIM2->ARR = one_active_axis_timer;

	jog_state.step_delay = new_step_delay;
}

#ifdef __cplusplus
extern "C" {
#endif  // #ifdef __cplusplus

void HardFault_Handler(void)
{
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
}

void BusFault_Handler(void)
{
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
}

void SysTick_Handler(void)
{
    absolute_tick++;
    
    parse();

    led_delay_count = ( (led_delay_count + 1) % LED_DELAY_MS );
    if(led_delay_count == 0) {
        led_state       = led_state_next;
        led_state_next  = led_idle;
    }
    
    IWDG->KR  = 0xAAAA;
}

void USART1_IRQHandler(void)
{
    uint8_t in_char = (USART1->DR & 0xFF);
    buffer_char(in_char);
}

void EXTI1_IRQHandler(void)
{
    // Core critical section, nothing shall happen here
    __disable_irq();
    int16_t cnt = TIM3->CNT;
    TIM3->CNT = 0;

    absolute_pos += cnt;

    if (cnt < 0) {
        absolute_idx--;
    } else {
        absolute_idx++;
    }

    EXTI->PR |= EXTI_PR_PR1;

    if (cnt != 3 && cnt != -3 &&
        cnt != 2880 && cnt != -2880) {
        error_index_offset = (int32_t)cnt;
    }
    
    if (cnt == 2880 || cnt == -2880) {
        index_zero_occured = 1;
    }

    static int32_t last_absolute_tick = 0;
    current_index_delta = abs(absolute_tick - last_absolute_tick);
    last_absolute_tick = absolute_tick;
    __enable_irq();
}

void TIM2_IRQHandler(void)
{
    static int32_t stepper_dir_z = 0; // direction is undefined by default
    static int32_t stepper_dir_x = 0; // direction is undefined by default
    static int32_t stepper_dir_d = 0; // direction is undefined by default

    if ((TIM2->SR & TIM_SR_UIF)) {
        TIM2->SR &= ~(TIM_SR_UIF);

        *DWT_CYCCNT = 0;

        // Do nothing if we are in stop sync mode
        if (current_run_mode == run_mode_none ||
            current_run_mode == run_mode_idle) {
            return;
        }
        
        // Protect against TIM3 IRQ race
        __disable_irq();
        int16_t cnt = TIM3->CNT;
        int32_t absolute_actual_pos = absolute_pos;

        absolute_actual_pos += cnt - absolute_pos_start_offset;

        if (wait_for_index_zero) {
            if (index_zero_occured && current_run_mode != run_mode_cycle_pause) {
                wait_for_index_zero = 0;
                index_zero_occured = 0;
                absolute_pos_start_offset = cnt;
                absolute_pos = 0;
                absolute_actual_pos = 0;
                stepper_actual_pos_z = 0;
                stepper_actual_pos_x = 0;
                stepper_actual_pos_d = 0;
                stepper_off_z = 0;
                stepper_off_x = 0;
                stepper_off_d = 0;
            } else {
                // Do nothing until we hit index zero
                __enable_irq();
                return;
            }
        }
        __enable_irq();

        static uint32_t flip_z = 0;
        if (flip_z) {
            // by default, don't move
            int32_t stepper_target_pos_z = stepper_actual_pos_z;

