tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
            switch (current_run_mode) {
                case    run_mode_follow_zxd:
                case    run_mode_follow_z: {
#ifndef LIB_DIVIDE
                            int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_z);
                            int32_t v = stepper_follow_div_z;
                            stepper_target_pos_z = divls(int32_t(u>>32),uint32_t(u), v); 
#else  // #ifdef LIB_DIVIDE
                            stepper_target_pos_z = libdivide::libdivide_s64_do(int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_z), &stepper_follow_div_z_opt);
#endif  // #ifdef LIB_DIVIDE
                            stepper_target_pos_z += stepper_off_z;
                        } break;
                case    run_mode_jog_z: {
                			jog_calc_step_delay_time();
                			if (jog_state.run_state != STOP) {
                				if (jog_state.dir > 0) {
	                				stepper_target_pos_z++;
	                			}
                				if (jog_state.dir < 0) {
	                				stepper_target_pos_z--;
	                			}
                			}
                        } break;
                case    run_mode_cycle_pause:
                case    run_mode_cycle: {
#ifndef LIB_DIVIDE
                            int64_t u = int64_t(absolute_actual_pos) * int64_t(current_cycle[current_cycle_idx].stepper_mul_z);
                            int32_t v = current_cycle[current_cycle_idx].stepper_div_z;
                            stepper_target_pos_z = divls(int32_t(u>>32),uint32_t(u), v); 
#else  // #ifdef LIB_DIVIDE
                            int32_t mul_z = current_cycle[current_cycle_idx].stepper_mul_z;
                            const libdivide::libdivide_s64_t &div_z_opt = current_cycle[current_cycle_idx].stepper_div_z_opt;
                            stepper_target_pos_z = libdivide::libdivide_s64_do(int64_t(absolute_actual_pos) * int64_t(mul_z), &div_z_opt);
#endif  // #ifdef LIB_DIVIDE
                            stepper_target_pos_z += stepper_off_z;
                        } break;
                default: {
                        } break;
            }
            
            int32_t szdelta = stepper_target_pos_z - stepper_actual_pos_z;

            if (abs(szdelta) >= 2880) {
                error_state_out_of_sync = szdelta;
            }

            if (szdelta == 0) {
                // nop
            } else if (szdelta < 0) {
                if (stepper_dir_z != -1) {
                    stepper_dir_z = -1;
                    GPIOB->BSRR = GPIO_BSRR_BR14;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_z--;
                    GPIOB->BSRR = GPIO_BSRR_BS13;
                    flip_z ^= 1;
                }
            } else if (szdelta > 0) {
                if (stepper_dir_z != +1) {
                    stepper_dir_z = +1;
                    GPIOB->BSRR = GPIO_BSRR_BS14;        
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_z++;
                    GPIOB->BSRR = GPIO_BSRR_BS13;
                    flip_z ^= 1;
                }
            }
        } else {
			if (current_run_mode == run_mode_jog_z) {
				TIM2->ARR = jog_state.step_delay;
			}
            GPIOB->BSRR = GPIO_BSRR_BR13;
            flip_z ^= 1;
        }

        static uint32_t flip_x = 0;
        if (flip_x) {
            int32_t stepper_target_pos_x = stepper_actual_pos_x;
            
            switch (current_run_mode) {
                case    run_mode_follow_zxd:
                case    run_mode_follow_x: {
#ifndef LIB_DIVIDE
                            int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_x);
                            int32_t v = stepper_follow_div_x;
                            stepper_target_pos_x = divls(int32_t(u>>32),uint32_t(u), v); 
#else  // #ifdef LIB_DIVIDE
                            stepper_target_pos_x = libdivide::libdivide_s64_do(int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_x), &stepper_follow_div_x_opt);
#endif  // #ifdef LIB_DIVIDE
                            stepper_target_pos_x += stepper_off_x;
                        } break;
                case    run_mode_jog_x: {
                			jog_calc_step_delay_time();
                			if (jog_state.run_state != STOP) {
                				if (jog_state.dir > 0) {
	                				stepper_target_pos_x++;
	                			}
                				if (jog_state.dir < 0) {
	                				stepper_target_pos_x--;
	                			}
                			}
                        } break;
                case    run_mode_cycle_pause:
                case    run_mode_cycle: {
#ifndef LIB_DIVIDE
                            int64_t u = int64_t(absolute_actual_pos) * int64_t(current_cycle[current_cycle_idx].stepper_mul_x);
                            int32_t v = current_cycle[current_cycle_idx].stepper_div_x;
                            stepper_target_pos_x = divls(int32_t(u>>32),uint32_t(u), v); 
#else  // #ifdef LIB_DIVIDE
                            int32_t mul_x = current_cycle[current_cycle_idx].stepper_mul_x;
                            const libdivide::libdivide_s64_t &div_x_opt = current_cycle[current_cycle_idx].stepper_div_x_opt;
                            stepper_target_pos_x = libdivide::libdivide_s64_do(int64_t(absolute_actual_pos) * int64_t(mul_x), &div_x_opt);
#endif  // #ifdef LIB_DIVIDE
                            stepper_target_pos_x += stepper_off_x;
                        } break;
                default: {
                        } break;
            }

            int32_t sxdelta = stepper_target_pos_x - stepper_actual_pos_x;

            if (abs(sxdelta) >= 2880) {
                error_state_out_of_sync = sxdelta;
            }

            if (sxdelta == 0) {
                // nop
            } else if (sxdelta < 0) {
                if (stepper_dir_x != -1) {
                    stepper_dir_x = -1;
                    GPIOB->BSRR = GPIO_BSRR_BR5;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_x--;
                    GPIOB->BSRR = GPIO_BSRR_BS11;
                    flip_x ^= 1;
                }
            } else if (sxdelta > 0) {
                if (stepper_dir_x != +1) {
                    stepper_dir_x = +1;
                    GPIOB->BSRR = GPIO_BSRR_BS5;
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_x++;
                    GPIOB->BSRR = GPIO_BSRR_BS11;
                    flip_x ^= 1;
                }
            }
        } else {
			if (current_run_mode == run_mode_jog_x) {
				TIM2->ARR = jog_state.step_delay;
			}
            GPIOB->BSRR = GPIO_BSRR_BR11;
            flip_x ^= 1;
        }

        static uint32_t flip_d = 0;
        if (flip_d) {
            int32_t stepper_target_pos_d = stepper_actual_pos_d;
            
