tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
            switch (current_run_mode) {
                case    run_mode_follow_zxd:
                case    run_mode_follow_d: {
#ifndef LIB_DIVIDE
                            int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_d);
                            int32_t v = stepper_follow_div_d;
                            stepper_target_pos_d = divls(int32_t(u>>32),uint32_t(u), v); 
#else  // #ifdef LIB_DIVIDE
                            stepper_target_pos_d = libdivide::libdivide_s64_do(int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_d), &stepper_follow_div_d_opt);
#endif  // #ifdef LIB_DIVIDE
                            stepper_target_pos_d += stepper_off_d;
                        } break;
                case    run_mode_jog_d: {
                			jog_calc_step_delay_time();
                			if (jog_state.run_state != STOP) {
                				if (jog_state.dir > 0) {
	                				stepper_target_pos_d++;
	                			}
                				if (jog_state.dir < 0) {
	                				stepper_target_pos_d--;
	                			}
                			}
                        } break;
                case    run_mode_cycle_pause:
                case    run_mode_cycle: {
#ifndef LIB_DIVIDE
                            int64_t u = int64_t(absolute_actual_pos) * int64_t(current_cycle[current_cycle_idx].stepper_mul_d);
                            int32_t v = current_cycle[current_cycle_idx].stepper_div_d;
                            stepper_target_pos_d = divls(int32_t(u>>32),uint32_t(u), v); 
#else  // #ifdef LIB_DIVIDE
                            int32_t mul_d = current_cycle[current_cycle_idx].stepper_mul_d;
                            const libdivide::libdivide_s64_t &div_d_opt = current_cycle[current_cycle_idx].stepper_div_d_opt;
                            stepper_target_pos_d = libdivide::libdivide_s64_do(int64_t(absolute_actual_pos) * int64_t(mul_d), &div_d_opt);
#endif  // #ifdef LIB_DIVIDE
                            stepper_target_pos_d += stepper_off_d;
                        } break;
                default: {
                        } break;
            }

            int32_t sddelta = stepper_target_pos_d - stepper_actual_pos_d;

            if (abs(sddelta) >= 2880) {
                error_state_out_of_sync = sddelta;
            }

            if (sddelta == 0) {
                // nop
            } else if (sddelta < 0) {
                if (stepper_dir_d != -1) {
                    stepper_dir_d = -1;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_d--;
                    flip_d ^= 1;
                }
            } else if (sddelta > 0) {
                if (stepper_dir_d != +1) {
                    stepper_dir_d = +1;
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_d++;
                    flip_d ^= 1;
                }
            }
        } else {
			if (current_run_mode == run_mode_jog_d) {
				TIM2->ARR = jog_state.step_delay;
			}
            flip_d ^= 1;
        }

        if (current_run_mode == run_mode_cycle ||
            current_run_mode == run_mode_cycle_pause) {
            bool do_next_cycle_step = false;
            if (current_cycle[current_cycle_idx].target_axs == 0) {
                if (stepper_actual_pos_z == (current_cycle[current_cycle_idx].target_pos + stepper_off_z)) {
                    stepper_off_z = stepper_actual_pos_z;
                    do_next_cycle_step = true;
                }
            }
            if (current_cycle[current_cycle_idx].target_axs == 1) {
                if (stepper_actual_pos_x == (current_cycle[current_cycle_idx].target_pos + stepper_off_x)) {
                    stepper_off_x = stepper_actual_pos_x;
                    do_next_cycle_step = true;
                }
            }
            if (current_cycle[current_cycle_idx].target_axs == 2) {
                if (stepper_actual_pos_d == (current_cycle[current_cycle_idx].target_pos + stepper_off_d)) {
                    stepper_off_d = stepper_actual_pos_d;
                    do_next_cycle_step = true;
                }
            }
            if (do_next_cycle_step) {
                __disable_irq();
                absolute_pos = 0;
                absolute_pos_start_offset = cnt;
                current_cycle_idx++;
                if (current_cycle_idx == current_cycle_len) {
                    current_run_mode = run_mode_none;
                }
                if (current_cycle[current_cycle_idx].wait_for_index_zero) {
                    wait_for_index_zero = 1;
                    index_zero_occured = 0;
                }
                __enable_irq();
            }
        }

        cycle_counter = *DWT_CYCCNT;
    }
}

void TIM3_IRQHandler(void)
{
    if ((TIM3->SR & TIM_SR_UIF)) {
        TIM3->SR &= ~(TIM_SR_UIF);
    }
}

#ifdef __cplusplus
} // extern "C" {
#endif  // #ifdef __cplusplus

static void set_zero_pos()
{
    // Protect against TIM3 IRQ race
    __disable_irq();
    absolute_pos = 0;
    absolute_pos_start_offset = 0;
    stepper_actual_pos_z = 0;
    stepper_actual_pos_x = 0;
    stepper_actual_pos_d = 0;
    stepper_off_z = 0;
    stepper_off_x = 0;
    stepper_off_d = 0;
    wait_for_index_zero = 1;
    index_zero_occured = 0;
    __enable_irq();
}

static void maybe_enable_steppers()
{
    if (current_run_mode == run_mode_idle) {
        // Z axis
        GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
        // X axis
        GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
        return;
    }
    if (current_run_mode == run_mode_none) {
        switch (previous_run_mode) {
            case    run_mode_follow_z: {
                        // X axis 
                        GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
                    } break;
            case    run_mode_follow_x: {
                        // Z axis
                        GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
                    } break;
            case    run_mode_follow_zxd: {
                        // X axis
                        GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
                        //Z axis
                        GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
                    } break;
            default: {
                        // Z axis
                        GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
                        // X axis
                        GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
                    } break;
        }
        return;
    }

