tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
								int32_t step = 0;
								int32_t accel = 0;
								int32_t decel = 0;
								int32_t speed = 0;

                                sscanf(&buf[2],"%08x%08x%08x%08x",  
                                	(unsigned int *)&step, 	
									(unsigned int *)&accel, 
									(unsigned int *)&decel, 
									(unsigned int *)&speed);

								uint32_t max_s_lim;
								uint32_t accel_lim;

								if(step < 0) {
									jog_state.dir = -1;
									step = -step;
								}
								else {
									jog_state.dir = +1;
								}

								#define T1_FREQ 1382400
								#define ALPHA (2*3.14159/3200)
								#define A_T_x100 ((int32_t)(ALPHA*T1_FREQ*100)) 
								#define T1_FREQ_148 ((int32_t)((T1_FREQ*0.676)/100))
								#define A_SQ (int32_t)(ALPHA*2*10000000000)
								#define A_x20000 (int32_t)(ALPHA*20000)

								jog_state.min_delay = A_T_x100 / speed;
								jog_state.step_delay = (T1_FREQ_148 * sqrt(A_SQ / accel))/100;
								max_s_lim = (int32_t)speed*speed/(int32_t)(((int32_t)A_x20000*accel)/100);
								if(max_s_lim == 0) {
									max_s_lim = 1;
								}
								accel_lim = ((int32_t)step*decel) / (accel+decel);
								if(accel_lim == 0) {
									accel_lim = 1;
								}
								if(accel_lim <= max_s_lim) {
									jog_state.decel_val = accel_lim - step;
								}
								else{
									jog_state.decel_val = -((int32_t)max_s_lim*accel)/decel;
								}
								if(jog_state.decel_val == 0) {
									jog_state.decel_val = -1;
								}
								jog_state.decel_start = step + jog_state.decel_val;
								if(jog_state.step_delay <= jog_state.min_delay){
									jog_state.step_delay = jog_state.min_delay;
									jog_state.run_state = RUN;
								}
								else {
									jog_state.run_state = ACCEL;
								}
								jog_state.accel_count = 0;

								TIM2->ARR = jog_state.step_delay;
								
                                send_ok_response();
							}
                		} break;
                        
                case 'C': {
                            size_t pos = 1;
                            bool ok_to_run = true;

                            if (buf_pos < (1 + 1 + size_of_crc)) {
                                send_invalid_response();
                                break;
                            }

                            if (buf[pos] != 'X' && 
                                buf[pos] != 'Z' &&
                                buf[pos] != 'D' &&
                                buf[pos] != 'S' && 
                                buf[pos] != 'R' && 
                                buf[pos] != 'P') {
                                ok_to_run = false;
                                break;
                            }

                            if (buf[pos] == 'S') {
                                set_current_run_mode(run_mode_cycle);
                                break;
                            }

                            if (buf[pos] == 'P') {
                                set_current_run_mode(run_mode_cycle_pause);
                                break;
                            }

                            set_current_run_mode(run_mode_none);

                            if (buf[pos] == 'R') {
                                current_cycle_len = 0;
                                current_cycle_idx = 0;
                                break;
                            }


                            if (buf_pos < (1 + 1 + size_of_crc + 64)) {
                                send_invalid_response();
                                break;
                            }

                            cycle_entry entry;
                            entry.target_axs = (buf[pos] == 'X') ? 1 : ( (buf[pos] == 'D') ? 2 : 0); pos++;
							
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.target_pos); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_mul_z); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_div_z); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_mul_x); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_div_x); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_mul_d); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_div_d); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.wait_for_index_zero); pos += 8;

                            if (entry.stepper_div_z <= 0 ||
                                entry.stepper_div_x <= 0 ||
                                entry.stepper_div_d <= 0) {
                                ok_to_run = false;
                            }

                            int32_t gcd_z = gcd(entry.stepper_mul_z, entry.stepper_div_z); entry.stepper_mul_z /= gcd_z; entry.stepper_div_z /= gcd_z;
                            int32_t gcd_x = gcd(entry.stepper_mul_x, entry.stepper_div_x); entry.stepper_mul_x /= gcd_x; entry.stepper_div_x /= gcd_x;
                            int32_t gcd_d = gcd(entry.stepper_mul_d, entry.stepper_div_d); entry.stepper_mul_d /= gcd_d; entry.stepper_div_z /= gcd_d;

#ifdef LIB_DIVIDE
                            entry.stepper_div_z_opt = libdivide::libdivide_s64_gen(entry.stepper_div_z);
                            entry.stepper_div_x_opt = libdivide::libdivide_s64_gen(entry.stepper_div_x);
                            entry.stepper_div_d_opt = libdivide::libdivide_s64_gen(entry.stepper_div_d);
#endif  // #ifdef LIB_DIVIDE
                            
                            current_cycle[current_cycle_len++]= entry;

                            if (current_cycle_len >= current_cycle_max) {
                                ok_to_run = false;
                            }
							
                            if (ok_to_run) {
                                send_ok_response();
                            } else {
								current_cycle_len = 0;
								current_cycle_idx = 0;
								send_invalid_response();
                            }
                        } break;

                // Reset to zero
                case 'R': {
                            set_zero_pos();
                            send_ok_response();
                        } break;

                // Get raw status
                case 'S': {
                            int16_t cnt = TIM3->CNT;

                            char sts[256];
                            size_t pos = 0;
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_pos + cnt)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_actual_pos_z + stepper_off_z)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_actual_pos_x + stepper_off_x)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_actual_pos_d + stepper_off_d)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(cnt)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_idx)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(current_index_delta)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_pos_start_offset)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_mul_z)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_div_z)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_mul_x)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_div_x)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_mul_d)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_div_d)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_counter)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(error_index_offset)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_tick)); pos += 8; 

